3) /Users/diegon/Desktop/Backend/code_talent/app/Providers/AuthServiceProvider.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function boot()
     {
-        $this->registerPolicies();
+        
         //
     }
 }

4) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/LoginController.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function __construct()
     {
-        $this->middleware('guest')->except('logout');
+        
     }
 }

5) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/RegisterController.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function __construct()
     {
-        $this->middleware('guest');
+        
     }
     /**
      * Get a validator for an incoming registration request.

6) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/RegisterController.php:50    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      * @param  array  $data
      * @return \Illuminate\Contracts\Validation\Validator
      */
-    protected function validator(array $data)
+    private function validator(array $data)
     {
         return Validator::make($data, ['name' => ['required', 'string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', 'unique:users'], 'password' => ['required', 'string', 'min:8', 'confirmed']]);
     }

7) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/RegisterController.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     protected function validator(array $data)
     {
-        return Validator::make($data, ['name' => ['required', 'string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', 'unique:users'], 'password' => ['required', 'string', 'min:8', 'confirmed']]);
+        return Validator::make($data, ['email' => ['required', 'string', 'email', 'max:255', 'unique:users'], 'password' => ['required', 'string', 'min:8', 'confirmed']]);
     }
     /**
      * Create a new user instance after a valid registration.

8) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/RegisterController.php:53    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     protected function validator(array $data)
     {
-        return Validator::make($data, ['name' => ['required', 'string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', 'unique:users'], 'password' => ['required', 'string', 'min:8', 'confirmed']]);
+        return Validator::make($data, ['name' => ['string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', 'unique:users'], 'password' => ['required', 'string', 'min:8', 'confirmed']]);
     }
     /**
      * Create a new user instance after a valid registration.

9) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/RegisterController.php:54    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     protected function validator(array $data)
     {
-        return Validator::make($data, ['name' => ['required', 'string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', 'unique:users'], 'password' => ['required', 'string', 'min:8', 'confirmed']]);
+        return Validator::make($data, ['name' => ['required', 'string', 'max:255'], 'email' => ['string', 'email', 'max:255', 'unique:users'], 'password' => ['required', 'string', 'min:8', 'confirmed']]);
     }
     /**
      * Create a new user instance after a valid registration.

10) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/RegisterController.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     protected function validator(array $data)
     {
-        return Validator::make($data, ['name' => ['required', 'string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', 'unique:users'], 'password' => ['required', 'string', 'min:8', 'confirmed']]);
+        return Validator::make($data, ['name' => ['required', 'string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', 'unique:users'], 'password' => ['string', 'min:8', 'confirmed']]);
     }
     /**
      * Create a new user instance after a valid registration.

11) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/RegisterController.php:65    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      * @param  array  $data
      * @return \App\User
      */
-    protected function create(array $data)
+    private function create(array $data)
     {
         return User::create(['name' => $data['name'], 'email' => $data['email'], 'password' => Hash::make($data['password'])]);
     }
 }

12) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/RegisterController.php:67    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     protected function create(array $data)
     {
-        return User::create(['name' => $data['name'], 'email' => $data['email'], 'password' => Hash::make($data['password'])]);
+        return User::create(['email' => $data['email'], 'password' => Hash::make($data['password'])]);
     }
 }

14) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/VerificationController.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->middleware('auth');
-        $this->middleware('signed')->only('verify');
+        
         $this->middleware('throttle:6,1')->only('verify', 'resend');
     }
 }

15) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/Auth/VerificationController.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->middleware('auth');
         $this->middleware('signed')->only('verify');
-        $this->middleware('throttle:6,1')->only('verify', 'resend');
+        
     }
 }

91) /Users/diegon/Desktop/Backend/code_talent/app/Http/Middleware/Authenticate.php:17    [M] LogicalNot

--- Original
+++ New
@@ @@
      */
     protected function redirectTo($request)
     {
-        if (!$request->expectsJson()) {
+        if ($request->expectsJson()) {
             return route('login');
         }
     }
 }

92) /Users/diegon/Desktop/Backend/code_talent/app/Http/Middleware/Authenticate.php:18    [M] FunctionCall

--- Original
+++ New
@@ @@
     protected function redirectTo($request)
     {
         if (!$request->expectsJson()) {
-            return route('login');
+            route('login');
+            return null;
         }
     }
 }
