1) /Users/diegon/Desktop/Backend/code_talent/app/Candidate.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->belongsTo(Promotion::class);
     }
-    static function updateProgress(Candidate $candidate, float $percentage, Carbon $last_connection)
+    protected static function updateProgress(Candidate $candidate, float $percentage, Carbon $last_connection)
     {
         DB::table('candidates')->where('id', $candidate->id)->update(['percentage' => $percentage, 'last_connection' => $last_connection]);
     }
 }

4) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:20    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $scrappy_codeAcademy = new CodeAcademyScraping($candidate);
         $scrappy_soloLearn = new SoloLearnScraping($candidate);
         $courses = $candidate->promotion->courses;
-        $percentageSum = 0;
+        $percentageSum = -1;
         $lastConnections = [];
         foreach ($courses as $course) {
             if ($course->platform == 'codeacademy') {

5) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:20    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $scrappy_codeAcademy = new CodeAcademyScraping($candidate);
         $scrappy_soloLearn = new SoloLearnScraping($candidate);
         $courses = $candidate->promotion->courses;
-        $percentageSum = 0;
+        $percentageSum = 1;
         $lastConnections = [];
         foreach ($courses as $course) {
             if ($course->platform == 'codeacademy') {

6) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:32    [M] Assignment

--- Original
+++ New
@@ @@
             if ($course->platform == 'sololearn') {
                 $progress = Progress::fromSoloLearn($scrappy_soloLearn, $course);
             }
-            $percentageSum += $progress->percentage;
+            $percentageSum = $progress->percentage;
             array_push($lastConnections, $progress->getLastConnection());
         }
         $average_progress = $this->calculatePercentage($percentageSum, count($courses));

7) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:32    [M] PlusEqual

--- Original
+++ New
@@ @@
             if ($course->platform == 'sololearn') {
                 $progress = Progress::fromSoloLearn($scrappy_soloLearn, $course);
             }
-            $percentageSum += $progress->percentage;
+            $percentageSum -= $progress->percentage;
             array_push($lastConnections, $progress->getLastConnection());
         }
         $average_progress = $this->calculatePercentage($percentageSum, count($courses));

8) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:33    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
                 $progress = Progress::fromSoloLearn($scrappy_soloLearn, $course);
             }
             $percentageSum += $progress->percentage;
-            array_push($lastConnections, $progress->getLastConnection());
+            
         }
         $average_progress = $this->calculatePercentage($percentageSum, count($courses));
         $lastConnection = $this->findClosestDate($lastConnections);

9) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $average_progress = $this->calculatePercentage($percentageSum, count($courses));
         $lastConnection = $this->findClosestDate($lastConnections);
-        Candidate::updateProgress($candidate, $average_progress, $lastConnection);
+        
     }
     private function findClosestDate(array $lastConnections)
     {

10) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:53    [M] Minus

--- Original
+++ New
@@ @@
             return Carbon::now();
         }
         foreach ($lastConnections as $date) {
-            $interval[] = abs(strtotime(Carbon::now()) - strtotime($date));
+            $interval[] = abs(strtotime(Carbon::now()) + strtotime($date));
         }
         asort($interval);
         $closest = key($interval);

11) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:55    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         foreach ($lastConnections as $date) {
             $interval[] = abs(strtotime(Carbon::now()) - strtotime($date));
         }
-        asort($interval);
+        
         $closest = key($interval);
         return $lastConnections[$closest];
     }

12) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:66    [M] DecrementInteger

--- Original
+++ New
@@ @@
     private function calculatePercentage(int $percentageSum, int $coursesNumber)
     {
         if ($coursesNumber == 0) {
-            return 0;
+            return -1;
         }
         return floor($percentageSum / $coursesNumber);
     }
 }

13) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:66    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     private function calculatePercentage(int $percentageSum, int $coursesNumber)
     {
         if ($coursesNumber == 0) {
-            return 0;
+            return 1;
         }
         return floor($percentageSum / $coursesNumber);
     }
 }

14) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:68    [M] Division

--- Original
+++ New
@@ @@
         if ($coursesNumber == 0) {
             return 0;
         }
-        return floor($percentageSum / $coursesNumber);
+        return floor($percentageSum * $coursesNumber);
     }
 }

15) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:68    [M] RoundingFamily

--- Original
+++ New
@@ @@
         if ($coursesNumber == 0) {
             return 0;
         }
-        return floor($percentageSum / $coursesNumber);
+        return ceil($percentageSum / $coursesNumber);
     }
 }

16) /Users/diegon/Desktop/Backend/code_talent/app/Observers/CandidateObserver.php:68    [M] RoundingFamily

--- Original
+++ New
@@ @@
         if ($coursesNumber == 0) {
             return 0;
         }
-        return floor($percentageSum / $coursesNumber);
+        return round($percentageSum / $coursesNumber);
     }
 }

17) /Users/diegon/Desktop/Backend/code_talent/app/Promotion.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class Promotion extends Model
 {
     protected $fillable = ['name', 'course_id'];
-    public function candidates()
+    protected function candidates()
     {
         return $this->hasMany(Candidate::class);
     }


Timed Out mutants:
==================

2) /Users/diegon/Desktop/Backend/code_talent/app/Progress.php:68    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->last_connection;
     }
-    public function setLastConnection($last_connection)
+    protected function setLastConnection($last_connection)
     {
         $formattedDate = $this->checkFormat($last_connection);
         $this->last_connection = $formattedDate;

1) /Users/diegon/Desktop/Backend/code_talent/app/Course.php:16    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->name;
     }
-    public function promotions()
+    protected function promotions()
     {
         return $this->belongsToMany(Promotion::class, 'course_promotion', 'course_id', 'promotion_id');
     }

2) /Users/diegon/Desktop/Backend/code_talent/app/Course.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->belongsToMany(Promotion::class, 'course_promotion', 'course_id', 'promotion_id');
     }
-    public function progress()
+    protected function progress()
     {
         return $this->hasOne(Progress::class, 'progress_id');
     }
 }

17) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CandidateController.php:16    [M] DecrementInteger

--- Original
+++ New
@@ @@
 {
     protected function index()
     {
-        $candidates = Candidate::orderBy('percentage', 'ASC')->paginate(50);
+        $candidates = Candidate::orderBy('percentage', 'ASC')->paginate(49);
         return view('candidate.index', compact('candidates'));
     }
     protected function create()

18) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CandidateController.php:16    [M] IncrementInteger

--- Original
+++ New
@@ @@
 {
     protected function index()
     {
-        $candidates = Candidate::orderBy('percentage', 'ASC')->paginate(50);
+        $candidates = Candidate::orderBy('percentage', 'ASC')->paginate(51);
         return view('candidate.index', compact('candidates'));
     }
     protected function create()

19) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CandidateController.php:18    [M] FunctionCall

--- Original
+++ New
@@ @@
     protected function index()
     {
         $candidates = Candidate::orderBy('percentage', 'ASC')->paginate(50);
-        return view('candidate.index', compact('candidates'));
+        view('candidate.index', compact('candidates'));
+        return null;
     }
     protected function create()
     {

23) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CandidateController.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     protected function store(Request $request)
     {
-        $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required', 'sololearn' => 'required', 'codeacademy' => 'required']);
+        $this->validate($request, ['lastname' => 'required', 'email' => 'required', 'sololearn' => 'required', 'codeacademy' => 'required']);
         Candidate::create($request->all());
         return redirect()->route('candidate.index')->with('success', 'Registro creado satisfactoriamente');
     }

24) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CandidateController.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function store(Request $request)
     {
-        $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required', 'sololearn' => 'required', 'codeacademy' => 'required']);
+        
         Candidate::create($request->all());
         return redirect()->route('candidate.index')->with('success', 'Registro creado satisfactoriamente');
     }

25) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CandidateController.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function store(Request $request)
     {
         $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required', 'sololearn' => 'required', 'codeacademy' => 'required']);
-        Candidate::create($request->all());
+        
         return redirect()->route('candidate.index')->with('success', 'Registro creado satisfactoriamente');
     }
     protected function show($id)

27) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CandidateController.php:47    [M] Foreach_

--- Original
+++ New
@@ @@
     {
         $candidate = Candidate::find($id);
         $courses = $candidate->promotion->courses;
-        foreach ($courses as $course) {
+        foreach (array() as $course) {
             $progress[] = DB::table('progress')->where('course_id', $course->id)->get();
         }
         return view('candidate.perfil', compact('candidate', 'courses', 'progress'));

28) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CandidateController.php:51    [M] FunctionCall

--- Original
+++ New
@@ @@
         foreach ($courses as $course) {
             $progress[] = DB::table('progress')->where('course_id', $course->id)->get();
         }
-        return view('candidate.perfil', compact('candidate', 'courses', 'progress'));
+        view('candidate.perfil', compact('candidate', 'courses', 'progress'));
+        return null;
     }
     protected function edit($id)
     {

34) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CandidateController.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function update(Request $request, $id)
     {
         $this->validate($request, ['name' => 'required', 'lastname' => 'required', 'email' => 'required', 'sololearn' => 'required', 'codeacademy' => 'required']);
-        Candidate::find($id)->update($request->all());
+        
         return redirect()->route('candidate.index')->with('success', 'Registro actualizado satisfactoriamente');
     }
     public function destroy($id)

38) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:15    [M] IncrementInteger

--- Original
+++ New
@@ @@
 {
     public function index()
     {
-        $courses = Course::orderBy('name', 'ASC')->paginate(50);
+        $courses = Course::orderBy('name', 'ASC')->paginate(51);
         return view('courses.index', compact('courses'));
     }
     public function create()

39) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:15    [M] DecrementInteger

--- Original
+++ New
@@ @@
 {
     public function index()
     {
-        $courses = Course::orderBy('name', 'ASC')->paginate(50);
+        $courses = Course::orderBy('name', 'ASC')->paginate(49);
         return view('courses.index', compact('courses'));
     }
     public function create()

40) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:17    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function index()
     {
         $courses = Course::orderBy('name', 'ASC')->paginate(50);
-        return view('courses.index', compact('courses'));
+        view('courses.index', compact('courses'));
+        return null;
     }
     public function create()
     {

42) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:25    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function create()
     {
         $courses = Course::all();
-        return view('courses.create', compact('courses'));
+        view('courses.create', compact('courses'));
+        return null;
     }
     public function store(Request $request)
     {

46) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function store(Request $request)
     {
         $this->validate($request, ['name' => 'required']);
-        Course::create($request->all());
+        
         return redirect()->route('courses.index')->with('success', 'Registro creado satisfactoriamente');
     }
     public function show(Course $course)

47) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Course::create($request->all());
         return redirect()->route('courses.index')->with('success', 'Registro creado satisfactoriamente');
     }
-    public function show(Course $course)
+    protected function show(Course $course)
     {
         //
     }

49) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:50    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function edit($id)
     {
         $course = Course::find($id);
-        return view('courses.edit', compact('course'));
+        view('courses.edit', compact('course'));
+        return null;
     }
     public function update(Request $request, $id)
     {

51) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function update(Request $request, $id)
     {
-        $this->validate($request, ['name' => 'required', 'platform' => 'required']);
+        $this->validate($request, ['platform' => 'required']);
         Course::find($id)->update($request->all());
         return redirect()->route('courses.index')->with('success', 'Registro actualizado satisfactoriamente');
     }

52) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function update(Request $request, $id)
     {
-        $this->validate($request, ['name' => 'required', 'platform' => 'required']);
+        
         Course::find($id)->update($request->all());
         return redirect()->route('courses.index')->with('success', 'Registro actualizado satisfactoriamente');
     }

53) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function update(Request $request, $id)
     {
         $this->validate($request, ['name' => 'required', 'platform' => 'required']);
-        Course::find($id)->update($request->all());
+        
         return redirect()->route('courses.index')->with('success', 'Registro actualizado satisfactoriamente');
     }
     public function destroy($id)

55) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/CourseController.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function destroy($id)
     {
-        Course::find($id)->delete();
+        
         return redirect()->route('courses.index')->with('success', 'Registro eliminado satisfactoriamente');
     }
 }

67) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:16    [M] DecrementInteger

--- Original
+++ New
@@ @@
 {
     public function index()
     {
-        $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(50);
+        $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(49);
         return view('promotion.index', compact('promotions'));
     }
     public function create()

68) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:16    [M] IncrementInteger

--- Original
+++ New
@@ @@
 {
     public function index()
     {
-        $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(50);
+        $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(51);
         return view('promotion.index', compact('promotions'));
     }
     public function create()

69) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:18    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function index()
     {
         $promotions = Promotion::orderBy('created_at', 'ASC')->paginate(50);
-        return view('promotion.index', compact('promotions'));
+        view('promotion.index', compact('promotions'));
+        return null;
     }
     public function create()
     {

71) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:26    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function create()
     {
         $courses = Course::all();
-        return view('promotion.create', compact('courses'));
+        view('promotion.create', compact('courses'));
+        return null;
     }
     public function store(Request $request)
     {

75) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:38    [M] Foreach_

--- Original
+++ New
@@ @@
         $promotion = Promotion::create($request->all());
         $courses_id = $request->input('courses_id');
         $courses = [];
-        foreach ($courses_id as $id) {
+        foreach (array() as $id) {
             array_push($courses, Course::find($id));
         }
         $promotion->courses()->saveMany($courses);

76) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:40    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         $courses_id = $request->input('courses_id');
         $courses = [];
         foreach ($courses_id as $id) {
-            array_push($courses, Course::find($id));
+            
         }
         $promotion->courses()->saveMany($courses);
         return redirect()->route('promotion.index')->with('success', 'Registro creado satisfactoriamente');

77) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($courses_id as $id) {
             array_push($courses, Course::find($id));
         }
-        $promotion->courses()->saveMany($courses);
+        
         return redirect()->route('promotion.index')->with('success', 'Registro creado satisfactoriamente');
     }
     protected function show(Promotion $promotion)

79) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:59    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $promotion = Promotion::find($id);
         $courses = Course::all();
-        return view('promotion.edit', compact('promotion', 'courses'));
+        view('promotion.edit', compact('promotion', 'courses'));
+        return null;
     }
     public function update(Request $request, $id)
     {

83) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->validate($request, ['name' => 'required']);
         $promotion = Promotion::find($id);
-        $promotion->update($request->all());
+        
         $courses_ids = $request->courses_id;
         $promotion->courses()->detach();
         $promotion->courses()->attach($courses_ids);

84) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:71    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $promotion = Promotion::find($id);
         $promotion->update($request->all());
         $courses_ids = $request->courses_id;
-        $promotion->courses()->detach();
+        
         $promotion->courses()->attach($courses_ids);
         return redirect()->route('promotion.index')->with('success', 'Registro actualizado satisfactoriamente');
     }

85) /Users/diegon/Desktop/Backend/code_talent/app/Http/Controllers/PromotionController.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $promotion->update($request->all());
         $courses_ids = $request->courses_id;
         $promotion->courses()->detach();
-        $promotion->courses()->attach($courses_ids);
+        
         return redirect()->route('promotion.index')->with('success', 'Registro actualizado satisfactoriamente');
     }
     public function destroy($id)

97) /Users/diegon/Desktop/Backend/code_talent/app/Progress.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class Progress extends Model
 {
     protected $table = 'progress';
-    public function course()
+    protected function course()
     {
         return $this->belongsTo(Course::class);
     }
